---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.InapplicableDataException
source: html/7701072e-9a72-0822-a393-317881fed2c6.htm
---
# InapplicableDataException Members

Retrieves data needed to serialize the target object.